InformationRegisters/КомандировкиВСистемеБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КомандировкиВСистемеБронирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПоездки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Командировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КомандировкиСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФизическиеЛицаБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФизическиеЛицаБронированияКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныОтправкиСотрудниковБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправляется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУдачнойОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНеудачнойОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/БронированиеКомандировокСборСтатистики/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Бронирование командировок";
	// АПК:1297-вкл
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Заявка на командировку", СтатистикаЗаявокНаКомандировку(НачалоПериода));
	Статистика.Вставить("Бронирование командировок", СтатистикаБронированийКомандировок(НачалоПериода));
	Статистика.Вставить("Командировки в системе бронирования", СтатистикаКомандировокВСистемеБронирования(НачалоПериода));
	Статистика.Вставить("Физические Лица бронирования командировок", СтатистикаБронированийФизическихЛиц(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаЗаявокНаКомандировку(НачалоПериода)
	
	Таблица = Метаданные.Документы.ЗаявкаНаКомандировку;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Заявок";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Статус;
	ДанныеГруппировки.ПредставлениеГруппировки = "Статусов";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаБронированийКомандировок(НачалоПериода)
	
	Таблица = Метаданные.РегистрыСведений.БронированиеКомандировок;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.ЗаявкаНаКомандировку;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Бронирований";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Ресурсы.ДатаСостояния;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Ресурсы.Состояние;
	ДанныеГруппировки.ПредставлениеГруппировки = "Состояний";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаКомандировокВСистемеБронирования(НачалоПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(КомандировкиВСистемеБронирования.ИдентификаторПоездки) КАК Командировок
		|ИЗ
		|	РегистрСведений.КомандировкиВСистемеБронирования КАК КомандировкиВСистемеБронирования
		|ГДЕ
		|	КомандировкиВСистемеБронирования.ДатаИзменения > &НачалоПериода
		|	И КомандировкиВСистемеБронирования.ДатаИзменения <= &КонецПериода";
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Командировок", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Командировок")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаБронированийФизическихЛиц(НачалоПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.ПричинаОтправки КАК ПричинаОтправки,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ФизическиеЛица.ФизическоеЛицо) КАК ФизЛиц,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОтправляющиесяФизическиеЛица.ФизическоеЛицо) КАК ОтправляющихсяФизЛиц
		|ИЗ
		|	РегистрСведений.ФизическиеЛицаБронированияКомандировок КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаБронированияКомандировок КАК ОтправляющиесяФизическиеЛица
		|		ПО ФизическиеЛица.ФизическоеЛицо = ОтправляющиесяФизическиеЛица.ФизическоеЛицо
		|			И (ФизическиеЛица.Отправляется = ИСТИНА)
		|ГДЕ
		|	ФизическиеЛица.ДатаУдачнойОтправки > &НачалоПериода
		|	И ФизическиеЛица.ДатаУдачнойОтправки <= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ФизическиеЛица.ПричинаОтправки
		|ИТОГИ
		|	СУММА(ФизЛиц),
		|	СУММА(ОтправляющихсяФизЛиц)
		|ПО
		|	ОБЩИЕ";
	
	ПоказателиСтатистики = Новый Соответствие;
	ВыборкаВсего = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВсего.Следующий() Цикл
		
		ПоказателиСтатистики.Вставить("Физических лиц", ВыборкаВсего.ФизЛиц);
		ПоказателиСтатистики.Вставить("Отправляющихся физических лиц", ВыборкаВсего.ОтправляющихсяФизЛиц);
		
		ВыборкаПричиныОтправки = ВыборкаВсего.Выбрать();
		Пока ВыборкаПричиныОтправки.Следующий() Цикл
			ПредставлениеПеречисления = Строка(ВыборкаПричиныОтправки.ПричинаОтправки);
			Если Не ЗначениеЗаполнено(ПредставлениеПеречисления) Тогда
				ПредставлениеПеречисления = "Пустых причин отправки";
			КонецЕсли;
			ПоказателиСтатистики.Вставить(ПредставлениеПеречисления, ВыборкаПричиныОтправки.ФизЛиц);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти
